SpenceKonde/ATTinyCore/avr/cores/tiny/wiring.c
      // us dropped to no less than 29, so we can subtract 27
      us -= 27; // 2 cycles
    } else {
      // account for the time taken in the preceding commands.
      // we just burned 23 (25) cycles above, remove 6, (6*4 = 24)
      // us is at least 8, so we can subtract 6
      us -= 6; // 2 cycles
    }

  #elif F_CPU >= 12000000L
    // for the 12 MHz clock if somebody is working with USB

    // for a 1 microsecond delay, simply return.  the overhead
    // of the function call takes 14 (16) cycles, which is 1.3us
    if (us <= 1) return; //  = 3 cycles, (4 when true)

    // the following loop takes 1/3 of a microsecond (4 cycles)
    // per iteration, so execute it three times for each microsecond of
    // delay requested.
    us = (us << 1) + us; // x3 us, = 5 cycles

    // account for the time taken in the preceding commands.
    // we just burned 20 (22) cycles above, remove 5, (5*4 = 20)
    // us is at least 6 so we can subtract 5
    us -= 5; // 2 cycles

  #elif F_CPU >= 8000000L
    // for the 8 MHz internal clock

    // for a 1 and 2 microsecond delay, simply return.  the overhead
    // of the function call takes 14 (16) cycles, which is 2us
    if (us <= 2) return; //  = 3 cycles, (4 when true)

    // the following loop takes 1/2 of a microsecond (4 cycles)
    // per iteration, so execute it twice for each microsecond of
    // delay requested.
    us <<= 1; // x2 us, = 2 cycles

    // account for the time taken in the preceding commands.
    // we just burned 17 (19) cycles above, remove 4, (4*4 = 16)
    // us is at least 6 so we can subtract 4
    us -= 4; // = 2 cycles

  #elif F_CPU >= 6000000L
    // for that unusual 6mhz clock...

    // for a 1 to 3 microsecond delay, simply return.  the overhead
    // of the function call takes 14 (16) cycles, which is 2.5us
    if (us <= 3) return; //  = 3 cycles, (4 when true)

    // make the loop below last 6 cycles
  #undef  _MORENOP_
  #define _MORENOP_ " nop \n\t  nop \n\t"

    // the following loop takes 1 microsecond (6 cycles) per iteration
    // we burned 15 (17) cycles above, plus 2 below, remove 3 (3 * 6 = 18)
    // us is at least 4 so we can subtract 3
    us -= 3; // = 2 cycles

  #elif F_CPU >= 4000000L
    // for that unusual 4mhz clock...

    // for a 1 to 4 microsecond delay, simply return.  the overhead
    // of the function call takes 14 (16) cycles, which is 4us
    if (us <= 4) return; //  = 3 cycles, (4 when true)

    // the following loop takes 1 microsecond (4 cycles)
    // per iteration, so nothing to do here! \o/
    // ... in terms of rescaling.  We burned 15 (17) above plus 2 below,
    // so remove 5 (5 * 4 = 20), but we may at most remove 4 to keep us > 0.
    us -= 4; // = 2 cycles

  #elif F_CPU >= 2000000L
    // for that unusual 2mhz clock...

    // for a 1 to 9 microsecond delay, simply return.  the overhead
    // of the function call takes 14 (16) cycles, which is 8us
    if (us <= 9) return; //  = 3 cycles, (4 when true)
    // must be at least 10 if we want to do /= 2 -= 4

    // divide by 2 to account for 2us runtime per loop iteration
    us >>= 1; // = 2 cycles;

    // the following loop takes 2 microseconds (4 cycles) per iteration
    // we burned 17 (19) above plus 2 below,
    // so remove 5 (5 * 4 = 20), but we may at most remove 4 to keep us > 0.
    us -= 4; // = 2 cycles

  #else
    // for the 1 MHz internal clock (default settings for common AVR microcontrollers)
    // the overhead of the function calls is 14 (16) cycles
    if (us <= 16) return; // = 3 cycles, (4 when true)
    if (us <= 25) return; // = 3 cycles, (4 when true), (must be at least 25 if we want to subtract 22)

    // compensate for the time taken by the preceding and next commands (about 22 cycles)
    us -= 22; // = 2 cycles
    // the following loop takes 4 microseconds (4 cycles)
    // per iteration, so execute it us/4 times
    // us is at least 4, divided by 4 gives us 1 (no zero delay bug)
    us >>= 2; // us div 4, = 4 cycles
  #endif

  // busy wait
  __asm__ __volatile__ (
    "1: sbiw %0,1" "\n\t" // 2 cycles
        _MORENOP_         // more cycles according to definition
    "brne 1b" : "=w" (us) : "0" (us) // 2 cycles
  );
  // return = 4 cycles
}

// This clears up the timer settings, and then calls the tone timer initialization function (unless it's been disabled - but in this case, whatever called this isn't working anyway!
void initToneTimer(void)
{
  // Ensure the timer is in the same state as power-up
  #if defined(__AVR_ATtiny43__)
    TIMSK1 = 0;
    TCCR1A = 0;
    TCCR1B = 0;
    TCNT1  = 0;
    OCR1A  = 0;
    OCR1B  = 0;
    TIFR1  = 0x07;
  #elif (TIMER_TO_USE_FOR_TONE == 0)
    #warning "ATTinyCore only supports using Timer1 for tone - this is untested code!"
    // Just zero the registers out, instead of trying to name all the bits, as there are combinations of hardware and settings where that doesn't work
    TCCR0A = 0; // (0 << COM0A1) | (0 << COM0A0) | (0 << COM0B1) | (0 << COM0B0) |               |               | (0 << WGM01) | (0 << WGM00);
    TCCR0B = 0; // (0 <<  FOC0A) | (0 <<  FOC0B) |               |               | (0 <<  WGM02) | (0 <<   CS02) | (0 <<  CS01) | (0 <<  CS00);
    // Reset the count to zero
    TCNT0  = 0;
    // Set the output compare registers to zero
    OCR0A  = 0;
    OCR0B  = 0;
    #if defined(TIMSK)
      // Disable all Timer0 interrupts
      // Clear the Timer0 interrupt flags
      #if defined(TICIE0) // x61-series has an additional input capture interrupt...
        TIMSK &= ~((1 << OCIE0B) | (1 << OCIE0A) | (1 << TOIE0)|(1 << TICIE0));
        TIFR   =  ((1 <<  OCF0B) | (1 <<  OCF0A) | (1 <<  TOV0)|(1 <<   ICF0));
      #else
        TIMSK &= ~((1 << OCIE0B) | (1 << OCIE0A) | (1 << TOIE0));
        TIFR   =  ((1 <<  OCF0B) | (1 <<  OCF0A) | (1 <<  TOV0));
      #endif
    #elif defined(TIMSK0)
      // Disable all Timer0 interrupts
      TIMSK0 = 0; // can do this because all of TIMSK0 is timer 0 interrupt masks
      // Clear the Timer0 interrupt flags
      TIFR0 = ((1 << OCF0B) | (1 << OCF0A) | (1 << TOV0)); // no ICF0 interrupt on any supported part with TIMSK0
    #endif
  #elif (TIMER_TO_USE_FOR_TONE == 1) && defined(TCCR1)
    // Turn off Clear on Compare Match, turn off PWM A, disconnect the timer from the output pin, stop the clock
    TCCR1  = (0 << CTC1) | (0 << PWM1A) | (0 << COM1A1) | (0 << COM1A0) | (0 << CS13) | (0 << CS12) | (0 << CS11) | (0 << CS10);
    // 0 out TCCR1
    // Turn off PWM A, disconnect the timer from the output pin, no Force Output Compare Match, no Prescaler Reset
    GTCCR &= ~((1 << PWM1B) | (1 << COM1B1) | (1 << COM1B0) | (1 << FOC1B) | (1 << FOC1A) | (1 << PSR1));
    // Reset the count to zero
    TCNT1  = 0;
    // Set the output compare registers to zero
    OCR1A  = 0;
    OCR1B  = 0;
    OCR1C  = 0;
    // Disable all Timer1 interrupts & clear the Timer1 interrupt flags
    TIMSK &= ~((1 << OCIE1A) | (1 << OCIE1B) | (1 << TOIE1));
    TIFR   =  ((1 <<  OCF1A) | (1 <<  OCF1B) | (1 <<  TOV1));
  #elif (TIMER_TO_USE_FOR_TONE == 1) && defined(TCCR1E)
    TCCR1A = 0;
    TCCR1B = 0;
    TCCR1C = 0;
    TCCR1D = 0;
    TCCR1E = 0;
    // Reset the count to zero
    TCNT1  = 0;
    // Set the output compare registers to zero
    OCR1A  = 0;
    OCR1B  = 0;
    OCR1C  = 0;
    OCR1D  = 0;
    // Disable all Timer1 interrupts & clear the Timer1 interrupt flags
    TIMSK &= ~((1 << TOIE1) | (1 << OCIE1A) | (1 << OCIE1B) | (1 << OCIE1D));
    TIFR   =  ((1 <<  TOV1) | (1 <<  OCF1A) | (1 <<  OCF1B) | (1 <<  OCF1D));
  #elif (TIMER_TO_USE_FOR_TONE == 1)
    // Normal, well-behaved 16-bit Timer 1.
    // Turn off Input Capture Noise Canceler, Input Capture Edge Select on Falling, stop the clock
    TCCR1A = 0; // (0 << COM1A1) | (0 << COM1A0) | (0 << COM1B1) | (0 << COM1B0) |              |              | (0 << WGM11) | (0 << WGM10);
    TCCR1B = 0; // (0 <<  ICNC1) | (0 <<  ICES1) |               | (0 <<  WGM13) | (0 << WGM12) | (0 <<  CS12) | (0 <<  CS11) | (0 << CS10);
    TCNT1  = 0; // Reset the count to zero
    OCR1A  = 0; // Set the output compare registers to zero
    OCR1B  = 0;
    // Disable all Timer1 interrupts & clear the Timer1 interrupt flags
    #if defined(TIMSK)
      TIMSK &= ~((1 << TOIE1) | (1 << OCIE1A) | (1 << OCIE1B) | (1 << ICIE1));
      TIFR   =  ((1 <<  TOV1) | (1 <<  OCF1A) | (1 <<  OCF1B) | (1 <<  ICF1));
    #elif defined(TIMSK1)
      TIMSK1 = 0; // Could do below like others, but since it's not shared, can use assignment instead of R-M-W
      // &=  ~((1 << TOIE1) | (1 << OCIE1A) | (1 << OCIE1B) | (1 << ICIE1));
      TIFR1 = ((1 <<  TOV1) | (1 <<  OCF1A) | (1 <<  OCF1B) | (1 <<  ICF1));
    #endif
  #endif

  #if INITIALIZE_SECONDARY_TIMERS
  // Prepare the timer for PWM
    initToneTimerInternal();
  #endif
}

// initToneTimerInternal() - initialize the timer used for tone for PWM

#if INITIALIZE_SECONDARY_TIMERS
  static void initToneTimerInternal(void)
  {
    #if (defined(PLLTIMER1) || defined(LOWPLLTIMER1)) && !defined(PLLCSR)
      #error "Chip does not have PLL (only x5, x61 series do), which is selected (somehow) as timer1 clock source. If you have not modified the core, please report this to core maintainer."
    #elif defined(LOWPLLTIMER1) && CLOCK_SOURCE == 6
      #error "Low speed PLL as Timer1 clock source is NOT SUPPORTED when PLL is used as system clock source"
    #elif defined(PLLTIMER1) // option on x5 and x61
      if (!PLLCSR) {
        PLLCSR = (1 << PLLE);
        while (!(PLLCSR & 1)); // wait for lock
        PLLCSR = (1 << PCKE) | (1 << PLLE);
      }
    #elif defined(LOWPLLTIMER1) // option on x5 and x61
      if (!PLLCSR) {
        PLLCSR = (1 << LSM) | ( 1 <<PLLE);
        while (!(PLLCSR & 1)); // wait for lock
        PLLCSR = (1 << PCKE) | (1 << LSM) | (1 << PLLE);
      }
    #endif


    #if defined(__AVR_ATtinyX41__)
      TCCR1A   = (1 << WGM10) | (1 << COM1A1)| (1 << COM1B1); // enable OC1A, OC1B
      TCCR1B   = (ToneTimer_Prescale_Index << CS10); // set the clock
      TCCR2A   = (1 << WGM20) | (1 << COM2A1)| (1 << COM2B1); // enable OC2A, OC2B
      TCCR2B   = (ToneTimer_Prescale_Index << CS10); // set the clock
      TOCPMSA0 = 0b00010000; // PA4: OC0A, PA3: OC1B, PA2: N/A,  PA1: N/A
      TOCPMSA1 = 0b10100100; // PB2: OC2A, PA7: OC2B, PA6: OC1A, PA5: OC0B
      // TOCPMCOE = 0; // keep these disabled!
    #elif defined(__AVR_ATtiny828__)
      TCCR1A   = (1 << WGM10) | (1 << COM1A1)| (1 << COM1B1); // enable OC1A, OC1B
      TCCR1B   = (ToneTimer_Prescale_Index << CS10); // set the clock
      TOCPMSA0 = (0b11100100);  // PC3: OC1B, PC2: OC1A, PC1: OC0B, PC0 OC0A.
      TOCPMSA1 = (0b11001001);  // PC7: OC1B, PC6: OC0A, PC5: OC1A, PC4,OC0B
      // TOCPMCOE = 0; // keep these disabled!
    #elif (TIMER_TO_USE_FOR_TONE == 0)
      #warning "ATTinyCore only supports using Timer1 for tone - this is untested code!"
      // Use the Tone Timer for phase correct PWM
      TCCR0A = (1 << WGM00) | (0 << WGM01);
      TCCR0B = (ToneTimer_Prescale_Index << CS00) | (0 << WGM02);
    #elif defined(__AVR_ATtiny43__)
      TCCR1A = 3; // WGM 10 = 1, WGM11 = 1
      TCCR1B = 3; // prescaler of 64
    #elif (TIMER_TO_USE_FOR_TONE == 1) && defined(TCCR1) // ATtiny x5
      // Use the Tone Timer for fast PWM as phase correct not supported by this timer
      GTCCR = (1 << PWM1B);
      OCR1C = 0xFF; // Use 255 as the top to match with the others as this module doesn't have a 8bit PWM mode.
      TCCR1 = (1 << CTC1) | (1 << PWM1A) | (ToneTimer_Prescale_Index << CS10);
    #elif (TIMER_TO_USE_FOR_TONE == 1) && defined(TCCR1E) // ATtiny x61
      // Use the Tone Timer for phase correct PWM
      TCCR1A = (1 << PWM1A) | (1 << PWM1B);
      TCCR1C = (1 << PWM1D);
      TCCR1D = (1 << WGM10) | (0 << WGM11);
      TCCR1B = (ToneTimer_Prescale_Index << CS10);
    #elif (TIMER_TO_USE_FOR_TONE == 1 ) && defined(__AVR_ATtinyX7__)
      TCCR1A = (1 << COM1A1)|(1 << COM1B1)|(1 << WGM10);
      TCCR1B = (ToneTimer_Prescale_Index << CS10);
    #elif (TIMER_TO_USE_FOR_TONE == 1) // x4, x8, x313,
      // Use the Tone Timer for phase correct PWM
      TCCR1A = (1 << WGM10);
      TCCR1B = (0 << WGM12) | (0 << WGM13) | (ToneTimer_Prescale_Index << CS10); // set the clock
    #endif
  }
#endif



/*#if (defined(__AVR_ATtinyX41__) && F_CPU == 16000000 && CLOCK_SOURCE == 0 )
  // functions related to the 16 MHz internal option on ATtiny841/441.
  // 174 CALBOOST seems to work very well - it gets almost all of them close enough for USART, which is what matters. It was empirically determined from a few parts I had lying around.
  #define TINYX41_CALBOOST 174
  static uint8_t tinyx41_cal16m = 0;
  static uint8_t saveTCNT = 0;
  void oscBoost() {
    OSCCAL0 = (origOSC>MAXINITCAL?255:(origOSC + CALBOOST));
    _NOP();
  }
  void oscSafeNVM() {      // called immediately prior to writing to EEPROM.
    //TIMSK0& = ~(_BV(TOIE0)); // turn off millis interrupt - let PWM keep running (Though at half frequency, of course!)
    //saveTCNT = TCNT0;
    //if (TIFR0&_BV(TOV0)) { // might have just missed interrupt - recording as 255 is good enough (this may or may not have been what we recorded, but if it was still set, interrupt didn't fire)
    //  saveTCNT = 255;
    //}
    #ifndef DISABLEMILLIS
      saveMillis = millis(); //save low bytes of millis
    #endif
    set_OSCCAL(read_factory_calibration());
  }
*/
  //void oscDoneNVM(uint8_t bytes_written) {
    /* That's the number of bytes of eeprom written, at 3.3ms or so each.
     * EEPROM does it one at a time, but user code could call these two methods when doing block writes (up to 64 bytes). Just be sure to do the eeprom_busy_wait(); at the end, as in EEPROM.h.
     * Not so much because it's a prerequisite for this stupid correction to timing but because cranking the oscillator back up during the write kinda defeats the point of slowing it doewn...
     * 3.3ms is good approximation of the duration of writing a byte - it'll be about 3~4% faaster since we're running around 5V at default call - hence, we're picking 3.3ms - the oscillator
     * adjustment loops and these calculations should be fast enough that the time they dont take long enough to worry about...
     * relies on assumptions from implementation above of millis on this part at 16MHz!
     * millis interrupt was disabled when oscSaveNVM() was called - so we don't need to do anything fancy to access the volatile variables related to it.
     * 1 millis interrupt fires every 1.024ms, so we want 3.3/1.024= 3.223 overflows; there are 256 timer ticksin an overflow, so 57 timer ticks...
     */
    // FRACT_MAX = 125, FRACT_INC =3
    //set_OSCCAL(tinyx41_cal16m); //stored when we initially tuned
    //#ifndef DISABLEMILLIS
    /*
    uint8_t m = 3 * bytes_written; // the 3 whole overflows
    uint16_t tickcount = 57*bytes_written + saveTCNT;
    m += (tickcount >> 8); // overflows from theose extra /0.223's
    millis_timer_overflow_count += m; // done with actual overflows, so record that.
    uint16_t f = FRACT_INC*m + millis_timer_fract; // (m could be up to 207)
    while(f > FRACT_MAX){ // at most 621 + 124 = 745
      f -= FRACT_MAX;
      m++;
    }
    // now we're adding up the contributions to millis from the 0.024 part...
    // save the results
    millis_timer_fract = f;
    millis_timer_millis += m;
    TCNT0   = 0;
    TIFR0  |= _BV(TOV0);   // clear overflow flag
    TIMSK0 |= _BV(TOIE0); // enable overflow interrupt
    TCNT0 = tickcount;    // restore new tick count
    // wonder if it was worth all that just to write to the EEPROM while running at 16MHz off internal oscillator without screwing up millis and micros...
    */
    // I don't think it was, gonna go with a quicker dirtier method - we instead leave it running at half speed, saving the low byte of millis. Longest time at half-speed
    // is 3.3 * 64 around 200 ms for a max length block write. So if we leave millis running, and know that it's running at half speed... just take difference of the LSB
    // and add that much to millis.
    //(uint8_t)millis_timer_overflow_count
    //uint8_t milliserror=((uint8_t) millis())-saveMillis
    //#endif
  //}
//#endif



