SpenceKonde/ATTinyCore/avr/cores/tiny/wiring.c
  /* Initialize Primary Timer */
  #if (TIMER_TO_USE_FOR_MILLIS == 0)
    #if defined(WGM01) // if Timer0 has PWM
      #if defined(TOCPMCOE) // x41, 828 - these turn on the COM bits in init and ignore them later. Saves 6 bytes to do all the config of TCCR0A here vs a RMW cycle when initializing secondary timer(s)
        TCCR0A = (1 << WGM01) | (1 << WGM00) | (1 << COM1A1)| (1 << COM1B1); // turn on all the PWM, but the TCOPMOE is 0.
      #else
        TCCR0A = (1 << WGM01) | (1 << WGM00);
      #endif
    #endif
    #if defined(TCCR0B) // Almost everything
      TCCR0B = (MillisTimer_Prescale_Index << CS00);
    #else               // Tiny x8 has no PWM from timer0
      TCCR0A = (MillisTimer_Prescale_Index << CS00);
    #endif
  #else
    #warning "ATTinyCore only supports using Timer0 for millis - this is untested code!"
    #if (TIMER_TO_USE_FOR_MILLIS == 1) && defined(TCCR1) // ATtiny x5
      TCCR1 = (1 << CTC1) | (1 << PWM1A) | (MillisTimer_Prescale_Index << CS10);
      GTCCR = (1 << PWM1B);
      OCR1C = 0xFF; // Use 255 as the top to match with the others as this module doesn't have a 8bit PWM mode.
    #elif (TIMER_TO_USE_FOR_MILLIS == 1) && defined(TCCR1E) // ATtiny x61
      TCCR1C = (1 << PWM1D);
      TCCR1B = (MillisTimer_Prescale_Index << CS10);
      TCCR1A = (1 << PWM1A) | (1 << PWM1B);
      OCR1C = 0xFF; // Use 255 as the top to match with the others as this module doesn't have a 8bit PWM mode.
    #elif (TIMER_TO_USE_FOR_MILLIS == 1)
      TCCR1A = (1 << WGM10);
      TCCR1B = (1 << WGM12) | (MillisTimer_Prescale_Index << CS10);
    #endif
  #endif
  /* Enable millis timekeeping */
  #ifndef DISABLEMILLIS
    #if   defined(TIMSK)  && defined(TOIE0) && (TIMER_TO_USE_FOR_MILLIS == 0)
      TIMSK  |=  (1 << TOIE0);
    #elif defined(TIMSK0) && defined(TOIE0) && (TIMER_TO_USE_FOR_MILLIS == 0)
      TIMSK0 |=  (1 << TOIE0);
    #elif defined(TIMSK)  && defined(TOIE1) && (TIMER_TO_USE_FOR_MILLIS == 1)
      TIMSK  |=  (1 << TOIE1);
    #elif defined(TIMSK1) && defined(TOIE1) && (TIMER_TO_USE_FOR_MILLIS == 1)
      TIMSK1 |=  (1 << TOIE1);
    #else
      #error "millis enabled, but not clear where the interrupt vector is enabled - probably means everything is busted!"
    #endif
  #endif

  // Initialize the timer used for Tone and additional PWM pins.
  // This includes Timer2 on 441/841 as well.
  #if INITIALIZE_SECONDARY_TIMERS
    initToneTimerInternal();
  #endif
  // Initialize the ADC
  #if defined( INITIALIZE_ADC ) && INITIALIZE_ADC
    #if defined(ADCSRA)
      // set a2d prescale factor
      // ADCSRA = (ADCSRA & ~((1 << ADPS2)|(1 << ADPS1)|(1 << ADPS0))) | (ADC_ARDUINO_PRESCALER << ADPS0) | (1 << ADEN);
      // This is being called on startup only. We know that ADCSRA is 0, reset value stated in datasheet. Why add a RMW cycle?!
      ADCSRA = (ADC_ARDUINO_PRESCALER << ADPS0) | (1 << ADEN);
    #else
      #error "Part has no ADC, but core configuration says to initialize it!"
    #endif
  #endif
  // enable interrupts; sketch setup() is next.
  sei();
  // end if init()
}


/* Okay, timer registers:
 * It is arguable whether it's actually better to check for these - the way we're doing it in these files,
 * we are often not checking for features, but specific families of parts handled case-by-case, and there
 * will never be new classic AVRs released.... so why not just test for part families when that's what we're doing?
 *
 * TCCR1E is only on x61.
 * TCCR1D is only on x7 and x61.
 * TCCR1 is only on x5
 * All non-85 have TCCR1A.
 *
 * Check for COM0xn bits to know if TIMER0 has PWM (it doesn't on x61 (it's a weird timer there - can be 16-bit) or
 * the x8 (because they cheaped out)
 */
